<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 6 changes.</summary>

```diff
+ tailscale_tailnet_key.tailscale_key will be created
! module.n8n_vm.proxmox_virtual_environment_vm.vm will be replaced due to changes in replace_triggered_by
! module.n8n_vm.terraform_data.combined_ci_hash will be updated in-place
! module.n8n_vm.terraform_data.creation_date will be replaced due to changes in replace_triggered_by
! module.n8n_vm.module.cloud_init_files[0].proxmox_virtual_environment_file.ci_user_data[0] must be replaced
! module.n8n_vm.module.cloud_init_files[0].random_id.random_id must be replaced
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 5 to add, 1 to change, 4 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-19T05:10:18Z [(view log)](https://github.com/perchnet/p/actions/runs/17060173528/job/48365428392#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # module.n8n_vm.proxmox_virtual_environment_vm.vm will be replaced due to changes in replace_triggered_by
-/+ resource "proxmox_virtual_environment_vm" "vm" {
      ~ id                      = "136" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:CD:2C:AC",
        ] -> (known after apply)
        name                    = "n8n-vm"
      ~ network_interface_names = [] -> (known after apply)
        tags                    = [
            "terraform",
        ]
      ~ vm_id                   = 136 -> (known after apply)
        # (24 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "base-9013-disk-1/vm-136-disk-1" -> (known after apply)
            # (14 unchanged attributes hidden)
        }
      ~ disk {
          ~ path_in_datastore = "vm-136-disk-2" -> "vm-131-disk-0"
            # (14 unchanged attributes hidden)
        }

      ~ initialization {
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          ~ user_data_file_id    = "snippets:snippets/39d294f74e02f1a4.user-data.yaml" -> (known after apply) # forces replacement
          + vendor_data_file_id  = (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:CD:2C:AC" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.n8n_vm.terraform_data.combined_ci_hash will be updated in-place
  ~ resource "terraform_data" "combined_ci_hash" {
        id     = "f03c6418-0dbd-7194-1077-7695b3100ab4"
      ~ input  = {
          ~ hash = (sensitive value)
        }
      ~ output = {
          - hash = "72fe38"
        } -> (known after apply)
    }

  # module.n8n_vm.terraform_data.creation_date will be replaced due to changes in replace_triggered_by
-/+ resource "terraform_data" "creation_date" {
      ~ id     = "66979b99-2c89-6427-152f-f180bd0a253d" -> (known after apply)
      ~ input  = {
          ~ timestamp = "2025-08-18T07:35:55Z" -> (known after apply)
        }
      ~ output = {
          - timestamp = "2025-08-18T07:35:55Z"
        } -> (known after apply)
    }

  # module.n8n_vm.module.cloud_init_files[0].proxmox_virtual_environment_file.ci_user_data[0] must be replaced
-/+ resource "proxmox_virtual_environment_file" "ci_user_data" {
      + file_modification_date = (known after apply)
      ~ file_name              = "39d294f74e02f1a4.user-data.yaml" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "snippets:snippets/39d294f74e02f1a4.user-data.yaml" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = (sensitive value) # forces replacement
          ~ file_name = "39d294f74e02f1a4.user-data.yaml" -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # module.n8n_vm.module.cloud_init_files[0].random_id.random_id must be replaced
-/+ resource "random_id" "random_id" {
      ~ b64_std     = "OdKU904C8aQ=" -> (known after apply)
      ~ b64_url     = "OdKU904C8aQ" -> (known after apply)
      ~ dec         = "4166556395157778852" -> (known after apply)
      ~ hex         = "39d294f74e02f1a4" -> (known after apply)
      ~ id          = "OdKU904C8aQ" -> (known after apply)
      ~ keepers     = { # forces replacement
          ~ "combined_ci_hash"                    = "72fe38" -> "1fe4ec"
          ~ "short_ci_user_data_contents_hash"    = "G6PhN4" -> "iwRieq"
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 1 to change, 4 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-72-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->